print(f" config.py ")


# UPLOAD_FOLDER = 'uploads'

class Config:
    DB_NAME = "test_csca_2" #TODO: DB for test creation on new categories.
    # DB_NAME = "test_csca_1" #TODO: DB for test creation on new categories.
    # DB_NAME = "test_new_category3" #TODO: DB for test creation on new categories.
    COLLECTION = "processed_records"
    CATEGORIES_COLLECTION = "categories"
    UPLOAD_FOLDER = 'uploads'
    GPT_REPETITION_CALLS = 5
    CONVERSATION_CATEGORIES = """
        Category list:
            Надання фінансової інформації
            Monobank
            Зʼєднання з менеджером
            Дзвінок зірвався, маяк, Не проходження ідентифікації
            Авторизовані операції(Тпін, зміна тел, лонг), Картки
            Рух коштів та баланс рахунків, кредити
            Інфо про банк (робота відділень, реквізити)
            Звернення клієнтів + контролюючі органи
            Тарифи та комісії
            Інформація про чат-бот, Ebanking
            Швидкі перекази (WesternUnion, MoneyGram, Swift та інші.)
            Замовлення готівки
            Валютообмін
            Депозити
            Консультація з питань Ebanking
            Пакети послуг
            Тарифи
            Кредити
            Депозити, депозитна лінія
    """
    GET_CATEGORY_FROM_GPT_PROMPT = """
        Я надам тобі транскрибцію розмови. 
        Ти маєш присвоїти розмові одну з категорій наданих в Category list.
        Якщо ти вважаєш, що жодна з категорій не відповідає змісту розмови, то надай власну категорію виключно укріїнською мовою, яка відповідатиме змісту розмови, а також обовʼязково надавай одну категорію зі списку в якості тимчасової доки не буде створена запропонована тобою категорія.
        Якщо категорія зі списку відповідає змісту розмови, лише замість нової категорії поверни "Null".
        Надавай відповідь у наступному json форматі:
        {
            "category_from_list": /category from list/,
            "potential_category": /new category/
        }
    """
    CLASSIFY_CATEGORIES_WITH_GPT_PROMPT = """
        Я надам тобі список категорій, це можуть бути однакові категорії за змістом, але перефразовані. Тобі потрібно проаналізувати ці категорії, поєднати подібні категорії та повернути список із унікальними категоріями за значенням. Відповідь українською мовою. Надавай відповідь у наступному json форматі:
        {
            "aggregated_category": [categorys_from_list,],
            "aggregated_category": [categorys_from_list,],
        }

        list:
    """
    #FIXME: original prompt, but too often give answer on eanglish
    # CLASSIFY_CATEGORIES_WITH_GPT_PROMPT = """
    #     Я надам тобі список категорій, це можуть бути однакові категорії за змістом, але перефразовані. Тобі потрібно проаналізувати ці категорії, поєднати подібні категорії та повернути список із унікальними категоріями за значенням. Надавай відповідь у наступному json форматі:
    #     {
    #         "aggregated_category": [categorys_from_list,],
    #         "aggregated_category": [categorys_from_list,],
    #     }

    #     list:
    # """
    categories_for_db = [
        "Надання фінансової інформації",
        "Monobank",
        "Зʼєднання з менеджером",
        "Дзвінок зірвався, маяк, Не проходження ідентифікації",
        "Авторизовані операції(Тпін, зміна тел, лонг), Картки",
        "Рух коштів та баланс рахунків, кредити",
        "Інфо про банк (робота відділень, реквізити)",
        "Звернення клієнтів + контролюючі органи",
        "Тарифи та комісії",
        "Інформація про чат-бот, Ebanking",
        "Швидкі перекази (WesternUnion, MoneyGram, Swift та інші.)",
        "Замовлення готівки",
        "Валютообмін",
        "Депозити",
        "Консультація з питань Ebanking",
        "Пакети послуг",
        "Тарифи",
        "Кредити",
        "Депозити, депозитна лінія"
    ]
